Repository: Infiziert90/WaymarkPresetPlugin
Catalog: WaymarkPresetPlugin/Resources/Language.*.resx
Languages: fr

# TextCommandDescription
source: Performs waymark preset commands. Use "{0}" for detailed usage information.
fr: Effectue des commandes pour les presets prédéfinis. Utilisez "{0}" pour accéder à davantage de détails sur ce sujet.

# TextCommandResponseHelpSubcommands
source: Valid commands are as follows: {0}, {1}, {2}, {3}, {4}, and {5}. If no command is provided, the preset library will be opened. Type "{6} <command>" for detailed subcommand information.
fr: Les commandes valides sont les suivantes : {0}, {1}, {2}, {3}, {4}, et {5}. Si aucune commande n'est renseignée, la bibliothèque de presets s'ouvrira. Tapez "{6} <command>" pour des informations détaillées sur les sous-commandes.

# TextCommandResponseHelpConfig
source: Opens the settings window.
fr: Ouvre la fenêtre de configuration.

# TextCommandResponseHelpSlotInfo
source: Prints the data saved in the game's slots to the chat window. Usage: "{0} slot". The slot number can be any valid game slot.
fr: Affiche les données sauvegardées dans les emplacements du jeu dans la fenêtre de discussion. Utilisation : "{0} <slot>". Le numéro d'emplacement peut être n'importe quel emplacement du jeu valide.

# TextCommandResponseHelpPlace
source: Places the preset with the specified name (if possible). Quotes MUST be used around the name. May also specify preset index without quotes instead. Usage: "{0} <name>|<index>". Name must match exactly (besides case). Index can be any valid libary preset number.
fr: Place les marqueurs d'un preset pré-enregistré avec le nom spécifié (si possible). Le nom DOIT être encadré par des guillemets. Un numéro d'index peut également être utilisé à la place du nom du preset, en omettant les guillemets. Utilisation : "{0} <name>|<index>". Le nom doit correspondre exactement (à part la casse). L'index peut être celui de n'importe quel numéro valide d'un preset existant dans la bibliothèque.

# TextCommandResponseHelpImport
source: Copies one of the game's five preset slots to the library. Usage: "{0} slot". The slot number can be any valid game slot. Command-line import of a formatted preset string is not supported due to length restrictions in the game's chat box.
fr: Copie vers la bibliothèque les marqueurs enregistrés depuis l'un des 5 emplacements de sauvegarde du jeu. Utilisation : "{0} <slot>". Le numéro de l'emplacement peut être celui de tout emplacement de sauvegarde du jeu valide. L'importation en ligne de commande d'un preset via chaîne de caractères n'est pas prise en charge du fait des limitations de la fenêtre de discussion du jeu.

# TextCommandResponseHelpExport
source: Copies a preset from the library to the specified game slot *or* copies a preset to the clipboard, depending on flags and parameters. Usage: "{0} [{1}] [{2}] slot|index [slot]". The slot number can be any valid game slot, and index can be any valid library preset number. Use of the {3} flag specifies that the first number is a game slot, not a library index. Use of the {4} flag includes the last-modified time in the clipboard export.
fr: Copie l'un des presets enregistrés dans la bibliothèque vers l'emplacement de sauvegarde du jeu spécifié *ou* vers le presse-papiers. Utilisation : "{0} [{1}] [{2}] <slot|index> [slot]". Le numéro de l'emplacement peut être celui de tout emplacement de sauvegarde du jeu valide. Le numéro d'index doit être celui de l'un des presets enregistrés dans la bibliothèque. L'option {3} indique que le premier nombre est un emplacement de jeu et non un index de la bibliothèque. L'option {4} permet d'ajouter la date de dernière modification aux données exportées vers le presse-papier.

# TextCommandResponseHelpExportAll
source: Copies all presets in the library to the clipboard, one per line. Add {0} if you wish to include the last-modified timestamp in the export.
fr: Copie tous les presets de la bibliothèque vers le presse-papiers, un par ligne. Ajoutez {0} si vous souhaitez que la date de dernière modification soit incluse.

# TextCommandResponseHelp
source: Use "{0}" to open the GUI. Use "{1}" for a list of text commands.
fr: Utilisez "{0}" pour ouvrir l'interface graphique. Utilisez "{1}" pour une liste des commandes texte.

# TextCommandResponseSlotInfoSuccess1
source: Slot {0} Contents : {1}
fr: Contenu du slot {0} : {1}

# TextCommandResponseSlotInfoError1
source: An unknown error occured while trying to read the game's waymark data.
fr: Une erreur inconnue s'est produite en essayant de lire les données des marqueurs du jeu.

# TextCommandResponseSlotInfoError2
source: Unable to read game's waymark data.
fr: Impossible de lire les données du jeu concernant les marqueurs.

# TextCommandResponseSlotInfoError3
source: An invalid game slot number was provided.
fr: Un numéro d'emplacement invalide du jeu a été fourni.

# TextCommandResponsePlaceError1
source: Unable to find preset "{0}".
fr: Impossible de trouver le preset "{0}".

# TextCommandResponsePlaceError2
source: Invalid preset number "{0}".
fr: Numéro de preset invalide "{0}".

# TextCommandResponsePlaceError3
source: An unknown error occured placing preset {0}.
fr: Une erreur inconnue est survenue durant le placement du preset {0}.

# TextCommandResponsePlaceError4
source: Invalid preset number "{0}".
fr: Numéro de preset invalide "{0}".

# TextCommandResponsePlaceError5
source: Unable to place preset. This probably means that the plugin needs to be updated for a new version of FFXIV.
fr: Impossible de placer le preset. Cela signifie probablement que le plugin doit être mis à jour pour une nouvelle version de FFXIV.

# TextCommandResponseImportSuccess1
source: Imported game preset {0} as library preset {1}.
fr: Marqueurs {0} du jeu importés en tant que preset {1} dans la bibliothèque.

# TextCommandResponseImportError1
source: An unknown error occured while trying to read the game's waymark data.
fr: Une erreur inconnue s'est produite en essayant de lire les données des marqueurs du jeu.

# TextCommandResponseImportError2
source: Unable to read game's waymark data. This probably means that the plugin needs to be updated for a new version of FFXIV.
fr: Impossible de lire les données des marqueurs. Cela signifie probablement que le plugin doit être mis à jour pour une nouvelle version de FFXIV.

# TextCommandResponseImportError3
source: An invalid game slot number was provided: "{0}".
fr: Un numéro d'emplacement de sauvegarde du jeu invalide a été fourni : "{0}".

# TextCommandResponseExportError1
source: No slot or index numbers were provided.
fr: Aucun emplacement ou numéro d'index n'a été fourni.

# TextCommandResponseExportError2
source: An invalid game slot number ({0}) was provided.
fr: Un numéro d'emplacement invalide du jeu ({0}) a été fourni.

# TextCommandResponseExportError3
source: An invalid library index ({0}) was provided.
fr: Un numéro d'index de bibliothèque invalide ({0}) a été fourni.

# TextCommandResponseExportSuccess1
source: Copied to clipboard.
fr: Copié dans le presse-papiers.

# TextCommandResponseExportError4
source: An invalid game slot number to export ({0}) was provided.
fr: Un numéro d'emplacement invalide du jeu ({0}) à exporter a été fourni.

# TextCommandResponseExportError5
source: An invalid library index ({0}) was provided.
fr: Un numéro d'index de bibliothèque invalide ({0}) a été fourni.

# TextCommandResponseExportSuccess2
source: Preset exported to game slot {0}.
fr: Preset exporté vers l'emplacement de sauvegarde du jeu {0}.

# TextCommandResponseExportError6
source: Unable to write to game slot {0}!
fr: Impossible d'écrire dans l'emplacement de sauvegarde du jeu {0} !

# TextCommandResponseExportError7
source: An invalid game slot number ({0}) was provided as the target.
fr: Le slot fourni du jeu numéro ({0}) est invalide.

# TextCommandResponseExportError8
source: An unknown error occured while trying to export the preset.
fr: Une erreur inconnue est survenue lors de l'export du preset.

# TextCommandResponseExportAllSuccess1
source: Waymark library copied to clipboard.
fr: La bibliothèque de marqueurs a été copiée dans le presse-papiers.

# TextCommandResponseExportAllError1
source: An unknown error occured while trying to copy presets to clipboard.
fr: Une erreur inconnue est survenue lors de la copie des presets vers le presse-papiers.

# WindowTitleDebugTools
source: Debug Tools
fr: Outils de débogage

# WindowTitlePresetEditor
source: Preset Editor
fr: Éditeur de presets

# EditWindowTextName
source: Name:
fr: Nom :

# EditWindowTextActiveColumnHeader
source: Active
fr: Actif

# DragandDropPreviewEditSwapWaymark
source: Swap Waymark {0} with...
fr: Permuter le Marqueur {0} avec...

# EditWindowTextZoneSearchLabel
source: Search:
fr: Rechercher :

# ButtonSave
source: Save
fr: Sauvegarder

# ButtonCancel
source: Cancel
fr: Annuler

# ButtonMapView
source: Map View
fr: Visualiser sur la carte

# WindowTitleWaymarkHelp
source: Waymark Help
fr: Aide de WaymarkPresetPlugin

# HelpWindowTextGeneral1
source: All presets in this plugin's list are fully separate from the game's presets. This allows you to store an unlimited number of presets, as well as to easily back up and share them, or import presets that others have shared with you.
fr: Les presets listés dans ce plugin sont différents des marqueurs enregistrés en jeu dans ses emplacements de sauvegarde. Cela permet d'avoir autant de presets que vous le désirez, de les sauvegarder et de les partager facilement ou même d'importer des presets que d'autres joueurs ont partagé avec vous.

# HelpWindowTextGeneral2
source: Selecting a preset in the library will show a window to the side with information about that preset, such as where the waymarks are placed, as well as actions that you can take with that preset.
fr: Sélectionner un preset dans la bibliothèque affichera des informations à son sujet dans une fenêtre additionnelle, comme l'emplacement des marqueurs, ainsi que les actions utilisables.

# HelpWindowTextGeneral3
source: If you want to copy a preset in the library to a game slot, select that preset in the list, and then press the button with the number of the slot to which you want to copy it. If you want to import a preset from the game's list into the library, scroll down to "Import Options" and press the button of the slot that you wish to import from the game. This is also where you can paste presets to import them from outside of the game.
fr: Sélectionnez un preset dans la bibliothèque et appuyez sur le bouton avec le numéro de l'emplacement de sauvegarde du jeu pour l'y copier. Pour importer une sauvegarde du jeu dans la bibliothèque, faites défiler vers le bas jusqu'à "Options d'importation" et appuyer sur le bouton de l'emplacement de sauvegarde que vous souhaitez importer depuis le jeu. C'est également depuis cet endroit qu'il est possible d'importer des presets depuis une source externe.

# HelpWindowTextGeneral4
source: If you wish to share a preset with someone else, you can select the preset in the library, and click the "Export to Clipboard" button.
fr: Pour partager un preset avec quelqu'un d'autre, sélectionnez-le dans la bibliothèque et appuyer sur le bouton "Exporter vers le presse-papiers".

# HelpWindowTextGeneral5
source: The plugin also allows you to place and save waymarks directly to/from the field. These are what the "Place" and "Save Current Waymarks" buttons do. Please note that saving and placing presets is only supported in areas that the game allows with its built in system. Saving presets outside of those duties will result in a preset that shows an unknown zone. Trying to place presets outside of those duties will simply fail to do anything.
fr: Le plugin vous permet aussi de placer et sauvegarder des marqueurs directement depuis ou vers le champ de bataille en utilisant les boutons "Placer" et "Sauver les marqueurs actuels". Veuillez noter que cela n'est possible que dans les zones où le jeu vous permet déjà de sauvegarder des marqueurs avec son système intégré. Si vous sauvegardez des marqueurs dans toute autre zone, le preset en résultant sera assigné à une zone inconnue. Tenter de placer des presets en dehors des missions où cela est permis ne fonctionnera pas.

# HelpWindowTextGeneral6
source: Presets can be reordered in the library by dragging and dropping them at the desired spot. The sorting of duties in the library is by default the same as they are sorted in the game's files, and is approximately the order in which the duties were added to the game. Duties can be drag and drop reordered if desired. If you create your own order by doing this, newly-seen duties will appear at the bottom of the list.
fr: Il est possible de changer l'ordre des presets dans la bibliothèque en les faisant glisser à l'endroit souhaité. Par défaut, les missions sont classées dans la bibliothèque dans le même ordre qu'elles le sont dans les fichiers du jeu, ce qui correspond plus ou moins à l'ordre dans lequel elles ont été ajoutées au jeu. Au besoin, les missions peuvent être réorganisées via glisser-déposer. Si vous changez l'ordre par défaut, les missions nouvellement découvertes après une mise à jour apparaîtra à la fin de la liste.

# HelpWindowTextEditing1
source: Clicking the "Edit" button in the preset info pane will bring up a window that allows you to edit a preset. You can adjust any of the available parameters, and you can drag waymarks on to other waymarks to swap their positions. You can also drag points from the circle calculator tab in this help window on to a waymark in the editor window to replace its coordinates with the ones from that calculator.
fr: Le bouton "Éditer" dans le volet d'information des presets ouvre une fenêtre vous permettant de modifier des marqueurs. Vous pouvez ajuster tous les paramètres disponibles et glisser-déposer des marqueurs par dessus d'autres marqueurs pour échanger leurs positions. Vous pouvez également faire glisser des points depuis le calculateur circulaire sur un marqueur dans la fenêtre d'édition pour remplacer ses coordonnées par celles du calculateur.

# HelpWindowTextEditing2
source: Changes made in the editor window will not be applied until the "Save" button is clicked.
fr: Les modifications apportées dans la fenêtre d'édition ne sont appliquées qu'après avoir cliqué sur le bouton "Sauvegarder".

# HelpWindowTextMaps1
source: The "Map View" window displays a copy of the applicable map(s) for the selected preset's duty. Any placed waymarks are shown on the map. If a zone has multiple submaps, you can switch between submaps using the dropdown in the lower right corner of the window. The world cordinates corresponding to your cursor position on the map are shown at the bottom right of the window. Please read the "Coordinates" tab of this help window if you wish to understand the game's internal coordinate systems, and their relationship to what is presented in-game to the player.
fr: La fenêtre "Vue de la carte" affiche une copie de la ou des cartes disponibles pour la mission sélectionnée. Tous les marqueurs placés sont affichés sur la carte. Si une zone a plusieurs sous-carte, vous pouvez basculer entre elles grâce au menu déroulant en bas à droite de la fenêtre. Les coordonnées de la carte correspondant à la position de votre curseur sur la carte sont affichées en bas à droite de la fenêtre. Merci de lire l'onglet "Coordonnées" de cette fenêtre d'aide si vous souhaitez en savoir plus sur le système de coordonnées du jeu et comment elles sont présentées en jeu au joueur.

# HelpWindowTextMaps2
source: When editing a preset, you can drag waymark icons on the map to adjust their positions. While you are doing this, the coordinate readout reflects the position of the marker, and not the position of your mouse. Please note that editing waymarks in this manner is not advised in areas that have uneven ground, as it is not possible to automatically adjust the Y coordinate to match the terrain.
fr: Lors de l'édition d'un preset, vous pouvez faire glisser les icônes de marqueurs sur la carte pour ajuster leurs positions. Pendant cette opération, les coordonnées affichées sont celles du marqueurs et non celle de la souris. Veuillez noter qu'il n'est pas recommandé d'utiliser cette méthode pour modifier les marqueurs dans les zones dont le sol n'est pas plat, car il est impossible d'ajuster automatiquement la coordonnée Y pour correspondre à l'élévation du terrain.

# HelpWindowTextMaps3
source: Please also note that the plugin cannot currently determine which waymarks are present on which submaps, so all waymarks are shown at their positions on all submaps (provided that they are within the map's bounds). For some rare cases (like e12s), the default submap is not the one in which you enter the area, so you will need to manually select the correct submap.
fr: Veuiilez noter également que le plugin ne peut pas pour le moment déterminer quels marqueurs correspondent à quelle sous-carte. Tous les marqueurs sont donc affichés à leur position sur toutes les sous-cartes (à condition qu'ils se trouvent dans les limites de la carte). Pour certains cas exceptionnels (comme par exemple e12s), la sous-carte par défaut n'est pas celle sur laquelle vous entrez en commençant la mission. Il faudra donc choisir manuellement la bonne sous-carte.

# HelpWindowTextCoordinates1
source: Coordinate Systems:
fr: Systèmes de coordonnées :

# HelpWindowTextCoordinates2
source: The game internally uses a right-handed 3D coordinate system, with X running West to East, Y running down to up, and Z running North to South. The on-map coordinate system is a 2D projection of the XZ plane, with X running West to East, and Y running North to South. Please note that the coordinates presented in chat links or on the map widgets in game are scaled to arbitrary values, and the Y and Z axes are swapped. This plugin uses the game's internal coordinate systems as shown below:
fr: Le système de coordonnées 3D du jeu utilise la règle de la main droite, l'axe X allant de l'ouest à l'est, l'axe Y du bas vers le haut et l'axe Z du nord au sud. Le système de coordonnées utilisé sur les cartes est une projection en 2D du plan XZ, avec l'axe X orienté d'ouest en est et l'axe Y du nord au sud. Ce plugin utilise le système de coordonnées du jeu, comme montré dans le schéma ci-dessous :

# CircleComputerTextInstructions1
source: This calculator will compute radially symmetric points ("clock spots") with the information that you give it. You can then drag these into the preset editor to replace any waymarks with the calculated points, or you can use the buttons at the bottom of this pane.
fr: Ce calculateur détermine les points équidistants sur un cercle à partir des paramètres fournis. Vous pouvez ensuite faire glisser ces points vers l'éditeur de marqueurs prédéfinis pour remplacer tous les marqueurs par les points calculés ou utiliser les boutons en bas de ce panneau.

# CircleComputerTextCenterPosition
source: Center Position
fr: Position du centre

# CircleComputerTextRadius
source: Radius (y)
fr: Rayon (y)

# CircleComputerTextNumberofPoints
source: Number of Points
fr: Nombre de points

# CircleComputerTextAngleOffset
source: Angle Offset (deg)
fr: Angle de décalage (deg)

# DragandDropPreviewCircleComputerWaymark
source: Copy coordinates to...
fr: Copier les coordonnées vers...

# ButtonCopyPointsfromCircleComputer
source: Copy these points into the editor
fr: Copier ces points dans l'éditeur

# ButtonCreatePresetfromCircleComputer
source: Create a new preset using these points
fr: Créer un nouveau preset utilisant ces points

# DefaultPresetNameCircleComputer
source: Imported from Circle Computer
fr: Importé depuis le Calculateur Circulaire

# HeaderHelpWindowPageGeneral
source: General
fr: Général

# HeaderHelpWindowPageEditing
source: Editing
fr: Édition

# HeaderHelpWindowPageMaps
source: Maps
fr: Cartes

# HeaderHelpWindowPageCoordinates
source: Coordinates
fr: Coordonnées

# HeaderHelpWindowPageCircleCalculator
source: Circle Calculator
fr: Calculateur Circulaire

# WindowTitlePresetInfo
source: Preset Info
fr: Informations sur le Preset

# InfoPaneTextCopytoSlotLabel
source: Copy to slot:
fr: Copier vers le slot :

# ButtonPlace
source: Place
fr: Placer

# InfoPaneTextPresetInfoLabel
source: Preset Info:
fr: Informations du preset :

# InfoPaneTextWaymarkColumnHeader
source: Waymark
fr: Marque au sol

# InfoPaneTextUnusedWaymark
source: Unused
fr: Inutilisé

# InfoPaneTextLastModifiedLabel
source: Last Modified: {0}
fr: Dernière modif. : {0}

# ButtonExporttoClipboard
source: Export to Clipboard
fr: Exporter vers le presse-papiers

# ButtonEdit
source: Edit
fr: Éditer

# ButtonDelete
source: Delete
fr: Supprimer

# InfoPaneTextConfirmDeleteLabel
source: Confirm delete:
fr: Confirmer la suppression :

# ButtonYes
source: Yes
fr: Oui

# ButtonNo
source: No
fr: Non

# InfoPaneTextNoPresetSelected
source: No preset selected.
fr: Aucun preset n'est sélectionné.

# WindowTitleWaymarkLibrary
source: Waymark Library
fr: Bibliothèque de Marques au sol

# ConfigOptionFilteronCurrentZone
source: Filter on Current Zone
fr: Filtrer la zone actuelle

# ButtonSaveCurrentWaymarks
source: Save Current Waymarks
fr: Sauver les marqueurs actuels

# LibraryWindowTextZoneSearchLabel
source: Search Zones
fr: Rechercher une zone

# MainWindowTextNoPresetsFound
source: No presets match the current filter.
fr: Aucun preset ne correspond au filtre actuel.

# MainWindowTextLibraryEmpty
source: Preset library empty!
fr: La bibliothèque de presets est vide !

# HeaderImportOptions
source: Import Options
fr: Options d'importation

# HeaderExportandBackupOptions
source: Export/Backup Options
fr: Options d'exportation & de sauvegarde

# DragandDropPreviewMovingPreset
source: Moving:
fr: Déplacer :

# DragandDropPreviewMovetoBottom
source: <Move To Bottom>
fr: <Placer en dernier>

# DragandDropPreviewMovingZone
source: Moving:
fr: Déplacer :

# DragandDropPreviewMovetoTop
source: <Move To Top>
fr: <Déplacer au début>

# TextBoxPromptImport
source: Paste a preset here and click "Import".
fr: Collez un preset ici et cliquez sur "Importer".

# ButtonImport
source: Import
fr: Importer

# MainWindowTextImportfromGameSlotLabel
source: Or import from game slot:
fr: Ou importez depuis un slot du jeu :

# MainWindowTextPresetResourcesLink
source: Where to find importable presets
fr: Où trouver des presets pouvant être importés

# ButtonExportAllPresetstoClipboard
source: Export All Presets to Clipboard
fr: Exporter tous les presets vers le presse-papiers

# ButtonBackupCurrentConfig
source: Backup Current Config
fr: Sauvegarder la configuration actuelle

# HelpBackupCurrentConfig
source: Copies the current config file to a backup folder in the Dalamud 'pluginConfigs' directory.
fr: Copie le fichier de configuration actuel dans un dossier de sauvegarde à l'intérieur du répertoire "pluginConfigs" de Dalamud.

# WindowTitleMapView
source: Map View
fr: Visualisation de la Carte

# WindowTitleMapViewEditing
source: Map View - Editing
fr: Visualisation de la Carte - Édition

# MapWindowTextNoMapsAvailable
source: No maps available for this zone.
fr: Aucune carte n'est disponible pour cette zone.

# MapWindowTextUnnamedSubmapPlaceholder
source: Unnamed Sub-map {0}
fr: Sous-carte sans nom {0}

# MapWindowTextLoadingMaps
source: Loading zone map(s).
fr: Chargement de(s) carte(s) de la zone.

# MapWindowTextUnknownZone
source: Unknown Zone: No maps available.
fr: Zone inconnue : aucune carte n'est disponible.

# MapWindowTextNoPresetSelected
source: No Preset Selected
fr: Aucun preset n'est sélectionné

# WindowTitleConfig
source: Waymark Settings
fr: Paramètres de Waymark Preset Plugin

# ConfigOptionAlwaysShowInfoPane
source: Always show preset info pane.
fr: Toujours afficher le panneau d'info des presets.
