Repository: Infiziert90/WaymarkPresetPlugin
Catalog: WaymarkPresetPlugin/Resources/Language.*.resx
Languages: fr

# ConfigOptionClickingPresetUnselects
source: Clicking the selected preset unselects it.
fr: Cliquer sur un preset déjà sélectionné le désélectionne.

# ConfigOptionCategorizePresetsbyZone
source: Categorize presets by zone.
fr: Classer les presets par zone.

# ConfigOptionOpenandClosewithGameWindow
source: Open and close library with the game's waymark window.
fr: Ouvrir et fermer la bibliothèque en même temps que la fenêtre de marqueurs du jeu.

# ConfigOptionAttachtoGameWindow
source: Attach library window to the game's waymark window.
fr: Attacher la fenêtre de la bibliothèque à la fenêtre en jeu des Marqueurs au sol.

# ConfigOptionShowIDinZoneNames
source: Show ID numbers next to zone names.
fr: Affiche l'identifiant des zones à côté de leur nom.

# HelpShowIDinZoneNames
source: Shows the internal Content Finder ID of the zone/duty in some places. Generally only used for debugging.
fr: Affiche à certains endroits l'identifiant de la zone / mission utilisé par l'outil de mission. Généralement utilisé à des fins de débogage.

# ConfigOptionShowPresetIndices
source: Show the index of the preset within the library.
fr: Affiche le numéro d'index du preset dans la bibliothèque.

# HelpShowPresetIndices
source: The primary use of this is if you need to know the preset index to use within a text command. You can always leave this disabled if you only use the GUI.
fr: Utile principalement si vous souhaitez connaître l'index d'un preset pour l'utiliser dans une commande texte. Vous pouvez laisser cette option désactivée si vous n'utilisez que l'interface graphique.

# ConfigOptionAllowPresetDragandDrop
source: Allow drag and drop reordering of presets.
fr: Permettre la réorganisation des presets via glisser-déposer.

# ConfigOptionAllowZoneDragandDrop
source: Allow drag and drop reordering of zones.
fr: Permettre la réorganisation des zones via glisser-déposer.

# HelpAllowZoneDragandDrop
source: If this is enabled, you can change the order of preset folders sorted by zone. New zones will be added at the bottom of the list. This option has no effect if the 'Categorize presets by zone' option is disabled.
fr: Si cette option est activée, vous pouvez changer l'ordre des dossiers de presets lorsqu'ils sont triés par zone. Les nouvelles zones seront ajoutées à la fin de la liste. Cette option n'a pas d'effet si l'option "Classer les presets par zone" est désactivée.

# ConfigOptionSortZonesDescending
source: Sort zones descending (newest at the top).
fr: Trier les zones par ordre décroissant (la plus récente en haut).

# HelpSortZonesDescending
source: When this is checked, zones will be sorted roughly (SE's ordering isn't perfect) newest to oldest. When coupled with the "Allow drag and drop reordering of zones" option, new zones will be added at the top of the list (with everything else remaining in the same order below).
fr: Lorsque cette case est cochée, les zones seront triées grosso modo (le classement des zones par SE n'est pas parfait) de la plus récente à la plus ancienne. Si l'option "Permettre la réorganisation des zones par glisser-déposer" est également activée, les nouvelles zones seront ajoutées en haut de la liste (le reste restant dans le même ordre en dessous).

# ConfigOptionShowLibraryZoneFilterSearchBox
source: Show search box to filter zones in library window.
fr: Affiche un champ de recherche pour filtrer l'affichage des zones dans la fenêtre de la bibliothèque.

# HelpShowLibraryZoneFilterSearchBox
source: When this is checked, a search box will be shown at the top of the library window to filter the zones you want to see. This has no effect when the "Categorize presets by zone" option is disabled.
fr: Lorsque cette option est activée, un champ de recherche est affiché en haut de la fenêtre de la bibliothèque permettant de filtrer les zones affichées. Cette option n'a pas d'effet si l'option "Classer les groupes de marqueurs par zone" est désactivée.

# ConfigOptionAutoloadPresetsfromLibarary
source: Autoload presets from library.
fr: Charger automatiquement les presets depuis la bibliothèque.

# HelpAutoloadpresetsfromLibrary
source: Automatically loads the first five presets that exist in the library for a zone when you load into it. THIS WILL OVERWRITE THE GAME'S SLOTS WITHOUT WARNING, so please do not turn this on until you are certain that you have saved any data that you want to keep. Consider using this with the auto-import option below to reduce the risk of inadvertent preset loss.
fr: Charge automatiquement les cinq premiers presets disponibles pour une zone lorsque vous y entrez. CECI ÉCRASERA LE CONTENU DES EMPLACEMENTS DE JEU SANS AVERTISSEMENT, merci de n'activer cette option qu'après avoir sauvegardé les données que vous souhaiteriez garder. Envisagez d'activer l'option d'importation automatique ci-dessous pour réduire le risque de perte de presets.

# ConfigOptionAutosavePresetstoLibrary
source: Autosave presets to library.
fr: Sauvegarder automatiquement les presets dans la bibliothèque.

# HelpAutosavePresetstoLibrary
source: Automatically copies any populated game preset slots into the library upon exiting an instance.
fr: Copie automatiquement les marqueurs actuellement sauvegardés dans le jeu vers la bibliothèque à la sortie d'une instance.

# ConfigOptionSuppressTextCommandResponses
source: Suppress responses to text commands (besides '{0}').
fr: Masque la sortie des commandes texte (sauf celle de "{0}").

# ButtonClearAllMapViewData
source: Clear All Map View Data
fr: Effacer toutes les données d'affichage des cartes

# HelpClearAllMapViewData
source: This deletes all map view pan/zoom/submap state, resetting every map back to default.
fr: Réinitialise les paramètres personnalisés des cartes à leurs valeurs par défaut, incluant leur orientation, leur niveau de zoom et les sous-cartes.

# SettingsWindowTextConfirmDeleteLabel
source: Confirm delete:
fr: Confirmer la suppression :

# ButtonClearAllZoneSortData
source: Clear All Zone Sort Data
fr: Effacer toutes les données de tri des zones

# HelpClearAllZoneSortData
source: This deletes any custom ordering of the zones in the library window, and resets the sort order back to default.
fr: Supprime tout ordre personnalisé des zones dans la fenêtre de la bibliothèque et applique l'ordre de tri par défaut.

# ButtonSaveandClose
source: Save and Close
fr: Sauvegarder et fermer

# ButtonShowLibrary
source: Show Library
fr: Afficher la bibliothèque

# WaymarkStatusUnused
source: Unused
fr: Inutilisé

# PresetInfoErrorZoneName1
source: Error retrieving zone name!
fr: Erreur lors de la récupération du nom de la zone !

# PresetInfoLabelLastModified
source: Last Modified:
fr: Dernière modif. :

# DefaultPresetName
source: New Preset
fr: Nouveau preset

# DefaultPresetNameImported
source: Imported
fr: Importé
